#include <cstdio>

int main(){

  int val = 7, val2 = 999;
  int &refval = val, &refval2 = val2;
  //引用必须要初始化，使其绑定到一个变量上
  //修改引用的值将改变其所绑定的变量的值
  refval = -12;
  printf("%d %d\n",val,refval);//-12，refval的值和val一样
  
  //将引用b赋值给引用a将改变引用a所绑定的变量的值
  //引用一旦进行初始化（绑定），将始终绑定在同一特定对象上，无法绑定到另外一对象上

  refval = refval2;
  printf("%d %d\n",val, refval);

  return 0;
}

//作用在引用上的所有操作事实上都是作用在该引用所绑定的对象上

//用int *&refp = p；的方式将一个指针引用和一个指针绑定起来
//如果还是不理解，可以把引用认为是一个对象的别名（外号，简称等等）。

//在传参的时候，使用指针传参，编译器需要给指针另行分配存储单元，存储一个该指针的副本，在函数中对这个副本进行操作；而使用引用传参，编译器就不需要分配存储空间和保存副本了，函数将直接对实参进行操作。所以使用引用使得程序的运行速度更快，执行效率更高



