//类的使用
//将一个类定义并实现后，就可以用该类来创建对象了，创建的过程如同int，char等基本数据类型声明一个变量一样简单，例如我们有一个Point类，要创建一个Point的对象只需要：Point 对象名;
//创建一个类的对象成为该类的实例化，在创建的时候我们还可以对对象的属性进行相关的初始化，这样在创建完成后该对象就具有类一定的属性。将类进行实例化后系统才会根据该对象的实际需要，分配一定的存储空间。这样就可以使用该对象来访问或调用该对象所能提供的属性或方法了。

//以Point2中的代码为例，为了减少篇幅，我们把Point类的实现放在Point.h头文件中，通过 对象名.共有函数名（参数列表);的形式就可以调用该类对象所具有的方法，通过 对象名.公有数据成员 的形式可以访问对象中的数据成员。


#include <iostream> 
#include "Point.h"

int main(){

  Point M;//用定义好的类创建一个对象 点M
  M.setPoint(10,20);//设置M 点的x,y 值
  M.printPoint();//输出M 点的信息

  //cout<<M.xPos<<endl; //尝试通过对象M 访问属性xPos

  //代码在运行时会出现错误，Failed to evaluate M.xPos. 这是cout<<M.xPos<<endl; 这行造成的，它试图访问一个private对象中的私密数据xPos，如果将这行去掉便可正常运行。
  return 0;

}

